# -*- coding: utf-8 -*-

from openpyxl import load_workbook
import re

s = '''退休（职）确认|东临新区|361006-000201012000-GG-059-01
退休（职）确认|南丰县|361023-000201005000-GG-081-02
提前退休（职）确认|市本级|361000-000201010000-GG-269-01
提前退休（职）确认|东临新区|361006-000201012000-GG-060-01
提前退休（职）确认|南丰县|361023-000201005000-GG-079-02
提前退休（职）确认|广昌县|361030-000201008000-GG-052-02
养老金待遇申领|市本级|361000-000201010000-GG-195-01
养老金待遇申领|广昌县|361030-000201008000-GG-162-02
养老金待遇申领|东乡区|361029-000201008000-GG-269-01
养老金待遇申领|资溪县|361028-000201007000-GG-159-01
养老金待遇申领|金溪县|361027-000201010000-GG-197-04
养老金待遇申领|宜黄县|361026-000202008000-GG-171-01
养老金待遇申领|崇仁县|361024-000201006000-GG-313-01
养老金待遇申领|南丰县|361023-000201005000-GG-221-01
养老金待遇申领|黎川县|361022-000201007000-GG-210-02
养老金待遇申领|南城县|361021-000201020000-GG-201-01
养老金待遇申领|东临新区|361006-000201012000-GG-135-01
养老金待遇申领|临川区|361002-000201007000-GG-182-02
基本医疗保险在职转退休|市本级|361000-000702078000-GG-036-01
基本医疗保险在职转退休|广昌县|361030-000201019200-GG-002-14
基本医疗保险在职转退休|黎川县|361022-000201054000-GG-022-07
基本医疗保险在职转退休|乐安县|361025-000251053000-GG-047-03
基本医疗保险在职转退休|南城县|361021-000201074000-GG-034-07
基本医疗保险在职转退休|宜黄县|361026-000702060012-GG-002-14
住房公积金提取（离休、退休）|市本级|361000-000201049000-GG-020-07
住房公积金提取（离休、退休）|广昌县|361030-000201043000-GG-002-01-01
住房公积金提取（离休、退休）|东乡区|361029-000602075000-GG-008-01
住房公积金提取（离休、退休）|资溪县|361028-000201025000-GG-031-07-04
住房公积金提取（离休、退休）|金溪县|361027-000502046000-GG-015-04
住房公积金提取（离休、退休）|宜黄县|361026-000201046000-GG-003-04
住房公积金提取（离休、退休）|乐安县|361025-000602028000-GG-015-06
住房公积金提取（离休、退休）|崇仁县|361024-000602042000-GG-048-01
住房公积金提取（离休、退休）|南丰县|361023-0002010010001-GG-003-04
住房公积金提取（离休、退休）|黎川县|361022-000201058000-GG-003-05
住房公积金提取（离休、退休）|临川区|361002-0002010110065-GG-003-22'''

s2 = '''灵活就业登记|乐安县|361025-000202023000-GG-187-02
灵活就业登记|黎川县|361022-000201007000-GG-068-01
灵活就业社会保险登记|金溪县|361027-000201010000-GG-204-10
灵活就业社会保险登记|东临新区|361006-000201012000-GG-086-02
灵活就业人员社会保险费申报|东临新区|361006-000201004000-GG-144-01
灵活就业人员社会保险费申报|南丰县|361023-000602060000-GG-070-02
灵活就业人员社会保险费申报|崇仁县|361024-000201067000-GG-200-01
灵活就业人员社会保险费申报|高新区|361099-000201014000-GG-198-01'''

s3 = '''就业困难人员认定|南城县|361021-000201020000-GG-173-01
就业困难人员认定|广昌县|361030-000201008000-GG-191-01
就业困难人员认定|金溪县|361027-000201010000-GG-168-01
就业困难人员认定|东临新区|361006-000201012000-GG-092-01
就业困难人员认定|资溪县|361028-000201007000-GG-132-01
就业困难人员认定|东乡区|361029-000201008000-GG-285-01
失业保险金申领（失业前用人单位和本人已缴失业保险满一年）|宜黄县|361026-000202008000-GG-095-10
失业保险金申领（失业前用人单位和本人已缴失业保险满一年）|广昌县|361030-000201008000-GG-062-01-02
失业保险金申领（失业前用人单位和本人已缴失业保险满一年）|黎川县|361022-000201007000-GG-093-02
失业保险金申领（失业前用人单位和本人已缴失业保险满一年）|南丰县|361023-000201005000-GG-045-01-08
失业保险金申领（失业前用人单位和本人已缴失业保险满一年）|南丰县1|361023-000201005000-GG-045-01-07
'''
s4 = '''职工参保登记（社会保险）|东临新区|361006-000201012000-GG-053-03
社会保障卡申领|黎川县|361022-000201007000-GG-193-01
社会保障卡申领|崇仁县|361024-000201006000-GG-296-01
社会保障卡申领|乐安县|361025-000202023000-GG-216-01
社会保障卡申领|宜黄县|361026-000202008000-GG-128-05
社会保障卡申领|金溪县|361027-000201010000-GG-140-01
社会保障卡申领|广昌县|361030-000201008000-GG-214-01'''

s5 = '''军地养老保险关系转移接续|南丰县|361023-000201005000-GG-051-03
军地养老保险关系转移接续|高新区|361099-000201011000-GG-094-01
社会保障卡申领|崇仁县|361024-000201006000-GG-296-01
社会保障卡申领|宜黄县|361026-000202008000-GG-128-05
社会保障卡申领|金溪县|361027-000201010000-GG-140-01
社会保障卡申领|广昌县|361030-000201008000-GG-214-01
基本医疗保险关系转移接续|南丰县|361023-000201072000-GG-019-01
基本医疗保险关系转移接续|崇仁县|361024-000201030098-GG-018-01-02'''

s6 = '''一次性创业补贴申领|宜黄县|361026-000202008000-GG-152-02
一次性创业补贴申领|临川区|361002-000201007000-GG-178-03
一次性创业补贴申领|黎川县|361022-000201007000-GG-206-02
一次性创业补贴申领|乐安县|361025-000202023000-GG-290-01
一次性创业补贴申领|广昌县|361030-000201008000-GG-195-02
一次性创业补贴申领|南城县|361021-000201020000-GG-178-01
一次性创业补贴申领|资溪县|361028-000201007000-GG-129-02
一次性创业补贴申领|南丰县|361023-000201005000-GG-208-01
一次性创业补贴申领|东临新区|361006-000201012000-GG-090-01
一次性创业补贴申领|崇仁县|361024-000201006000-GG-309-02
一次性创业补贴申领|黎川县1|361022-000201007000-GG-206-01
一次性创业补贴申领|资溪县1|361028-000201007000-GG-129-01
一次性创业补贴申领|广昌县1|361030-000201008000-GG-195-01
流动人员人事档案接收|宜黄县|361026-000202008000-GG-099-01-05
流动人员人事档案接收|临川区|361002-000201007000-GG-006-01-06
流动人员人事档案接收|乐安县|361025-000202023000-GG-177-03
流动人员人事档案接收|黎川县|361022-000201007000-GG-073-01-04
流动人员人事档案接收|金溪县|361027-000201010000-GG-048-05
流动人员人事档案接收|崇仁县|361024-000201006000-GG-154-01-06'''

s7 = '''职工参保登记（社会保险）|东临新区|361006-000201012000-GG-053-03
社会保障卡申领|黎川县1|361022-000201007000-GG-193-01
社会保障卡申领|崇仁县|361024-000201006000-GG-296-01
社会保障卡申领|乐安县1|361025-000202023000-GG-216-01
社会保障卡申领|宜黄县|361026-000202008000-GG-128-05
社会保障卡申领|金溪县|361027-000201010000-GG-140-01
社会保障卡申领|广昌县|361030-000201008000-GG-214-01'''

s8 = '''个人公积金账户设立|崇仁县|361024-000602042000-GG-013-01
个人公积金账户设立|宜黄县|361026-000201046000-GG-002-07
个人公积金账户设立|资溪县|361028-000201025000-GG-033-09-01
个人公积金账户设立|临川区|361002-0002010110065-GG-002-18
个人公积金账户设立|乐安县|361025-000602028000-GG-014-05
个人公积金账户设立|黎川县|361022-000201058000-GG-002-05
个人公积金账户设立|金溪县|361027-000502046000-GG-001-17'''

#lose-job
t1 = '''就业困难人员认定|南丰县|361023-000201005000-GG-098-01|{"state":"300","error":"Index: 0, Size: 0"}
失业保险金申领（失业前用人单位和本人已缴失业保险满一年）|东乡区|361029-000602067000-GG-017-01-01|{"success":false}
失业保险金申领（失业前用人单位和本人已缴失业保险满一年）|宜黄县|361026-000202008000-GG-095-10|{"state":"300"}'''


def syncItemCodeExcelSubmit():
    workbook = load_workbook(
        filename='/home/zg/Downloads/work/oneThing/同步-zg.xlsx')
    sheet = workbook['Sheet1']

    for index, line in enumerate(t1.split('\n'), 2):
        if (not line):
            continue
        a1 = line.split('|')
        row = index
        for i, col in enumerate(range(1, 5)):
            print(row)
            print(col)
            sheet.cell(row, col).value = a1[i]
            # pass
    workbook.save('/home/zg/Downloads/work/oneThing/提交表单出错-zg_失业一件事2.xlsx')


def syncItemCodeExcel():
    workbook = load_workbook(
        filename='/home/zg/Downloads/work/oneThing/同步-zg.xlsx')
    sheet = workbook['Sheet1']

    for index, line in enumerate(s8.split('\n'), 2):
        if (not line):
            continue
        a1 = line.split('|')
        row = index
        for i, col in enumerate(range(1, 4)):
            print(row)
            print(col)
            sheet.cell(row, col).value = a1[i]
            # pass
    workbook.save('/home/zg/Downloads/work/oneThing/同步-zg_高校就业一件事.xlsx')


if __name__ == '__main__':
    # syncItemCodeExcel()
    syncItemCodeExcelSubmit()
    pass